#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-mCAs5F5wixddjb5d

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
random_password.db_password: Refreshing state... [id=none]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_method.actions: Refreshing state... [id=agm-gcp9dahm4c-i57f4h-ANY]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-i57f4h-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=r8ef9v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-03-10T08:04:05.001Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
-/+ resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2021-07-29T19:26:44Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/test" -> (known after apply)
      ~ id            = "r8ef9v" -> (known after apply)
      ~ invoke_url    = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "d39597189c0e684d4c5aedb3f9efa542dd8c057b"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.actions must be replaced
-/+ resource "aws_api_gateway_integration" "actions" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "i57f4h" -> (known after apply)
      ~ id                      = "agi-gcp9dahm4c-i57f4h-ANY" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "i57f4h" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_method.actions will be destroyed
  - resource "aws_api_gateway_method" "actions" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "ANY" -> null
      - id                   = "agm-gcp9dahm4c-i57f4h-ANY" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "i57f4h" -> null
      - rest_api_id          = "gcp9dahm4c" -> null
    }

  # aws_api_gateway_method.actions_proxy will be created
  + resource "aws_api_gateway_method" "actions_proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.actions_proxy will be created
  + resource "aws_api_gateway_resource" "actions_proxy" {
      + id          = (known after apply)
      + parent_id   = "i57f4h"
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-03-10T08:03:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "DIwAIFgqt5XLQyMYxRkx9tnjzypau+aq4XFmPQMaXvc=" -> "iDpdBi+Zyo/BeIxXlZf0gltrB/h/9pdkPLS48r7Njqg="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-03-10T08:03:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "S8X6BzbM2a9A7mnt8M/RxOIOI+fr5eEicieoDUxvAf8=" -> "1GasnW6UoykbIeSBgc2kCDWSpBNUBKRHnNG8KoOf1L0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-03-10T08:03:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "3CG9fI1PcCV4sAaJOVmamqAmIGttRhRjt9CoyeugzRA=" -> "7Ao0VBwBeGkexIbhmCTcwEIvfGEQdC2N/DuwjCapCWE="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  ~ base_url     = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-03-10T08:04:05.001Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*